---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Document..::..NewFlexPipe Method
Document Class See Also Send Feedback
---

Adds a new flexible pipe into the document.

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | NewFlexPipe(IList<(Of <<'(XYZ>)>>), FlexPipeType) | Adds a new flexible pipe into the document, using a point array and pipe type. |
|  | NewFlexPipe(Connector, Connector, FlexPipeType) | Adds a new flexible pipe into the document, using two connector, and flexible pipe type. |
|  | NewFlexPipe(Connector, IList<(Of <<'(XYZ>)>>), FlexPipeType) | Adds a new flexible pipe into the document, using a connector, point array and pipe type. |

# See Also

Document Class

Document Members

Autodesk.Revit.Creation Namespace